In [1]:
import pandas as pd

In [2]:
'l1 l2 l3 l4'.split()

['l1', 'l2', 'l3', 'l4']

In [4]:
data = [(1, 2, 3, 4),
       (5, 6, 7, 8),
       (9, 10, 11, 12),
       (13, 14, 15, 16)]
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split() )

In [5]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [6]:
df['c1'] # series

l1     1
l2     5
l3     9
l4    13
Name: c1, dtype: int64

In [8]:
df[['c3', 'c1']]

    c3  c1
l1   3   1
l2   7   5
l3  11   9
l4  15  13

In [10]:
df[:]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [11]:
df[1:]

    c1  c2  c3  c4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [12]:
df[:2]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8

In [13]:
df[:2][['c1', 'c2']]

    c1  c2
l1   1   2
l2   5   6

In [15]:
df.loc['l3']

c1     9
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [20]:
df.loc[['l1', 'l2']]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8

In [21]:
df.loc['l1', 'c4'] #cruza a localização e traz o valor da célula

4

In [22]:
df.iloc[0,1] #cruza as informações das linhas e colunas e traz o valor da celula.

2

In [23]:
df.loc[['l4', 'l2'], ['c3', 'c2']]

    c3  c2
l4  15  14
l2   7   6

In [25]:
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

In [27]:
df.iloc[[3, 1], [2, 1]]

    c3  c2
l4  15  14
l2   7   6